<template>
     <div class="result-context m-5" v-if="this.id == 0">
        <p>過去の未練や引っかかる出来事などで、暗闇を恐る恐る歩いているイメージ。</p>
        <br>    
        <p>やることが空回りしてしまって、中々思い通りに進めない1日になりそうです。</p>
        <br>
        <p>不安が大きく中々前進できないときは無理に進まず立ち止まってもOK。</p>
        <br>    
        <p>あなたのペースを大切に。</p>
      </div>

     <div class="result-context m-5" v-else-if="this.id == 1">
        <p>誘惑が多い日になりそうです。</p>
        <br>
        <p>ずるずるした恋愛に引き込まれてしまいそうなので、しっかりと自分の意見を持って！</p>
        <br>
        <p>なんとなくピンとこないお誘いなどはきっぱり断ってしまいましょう。</p>
        <br>    
        <p>言い合いにもなりやすい日ですが、意地になるのではなく話し合いは冷静に。</p>
      </div>
     <div class="result-context m-5" v-else-if="this.id == 2">
        <p>自分に嘘をつかず、正直に気持ちを伝えることを意識しましょう！</p>
        <br>
        <p>そうすれば、意中の相手との関係性が安定してきます。</p>      
        <br>
        <p>ただし、状況を急かしたりすることはNGです。</p>
        <br>    
        <p>恋愛の発展には、あなた自信が焦らずにゆっくりと落ち着いていることが大事です。</p>
      </div>

</template>

<script>
export default {

  props: ["id"],

  data() {
    return {
      
    }
  }
}
</script>
